Revit 2024 API
FabricSheetType.MajorDirectionWireType Property
 The id of the FabricWireType to be used in the major direction.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ElementId MajorDirectionWireType { get; set; }
Visual Basic
Public Property MajorDirectionWireType As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ MajorDirectionWireType {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: the ElementId majorDirectionWireType is either invalid or not a FabricWireType.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: Fabric Sheet Type is Custom
See Also
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace